cases/pdmsMicrochannelFSI/stabilityStudy/semiImplicitBetaIQNILS/0/fluid/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version         2;
    format          ascii;
    arch            "LSB;label=32;scalar=64";
    class           volVectorField;
    location        "252";
    object          U;
}

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform ( 0 0 0 );

boundaryField
{
    inlet
    {
        type            flowRateInletVelocity;
        // Phase-5 gate: exactly 1% of the production flow rate.
        volumetricFlowRate constant 1e-11;
        value           uniform ( 0 0 0 );
    }
    glass
    {
        type            slip;
    }
    interface
    {
        type            elasticWallVelocity;
        value           uniform ( 0 0 0 );
    }
    outlet
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
