cases/pdmsMicrochannelFSI/stabilityStudy/semiImplicitBetaIQNILS/0/fluid/pointMotionU
FoamFile
{
    version 2.0;
    format ascii;
    class pointVectorField;
    object pointMotionU;
}

dimensions [0 1 -1 0 0 0 0];
internalField uniform (0 0 0);
boundaryField
{
    inlet
    {
        type fixedValue;
        value uniform (0 0 0);
    }
    outlet
    {
        type fixedValue;
        value uniform (0 0 0);
    }
    glass
    {
        type fixedValue;
        value uniform (0 0 0);
    }
    interface
    {
        type fixedValue;
        value uniform (0 0 0);
    }
}
