cases/pdmsMicrochannelFSI/stabilityStudy/semiImplicitBetaIQNILS/0/solid/pointD
FoamFile
{
    version 2.0;
    format ascii;
    class pointVectorField;
    object pointD;
}

dimensions [0 1 0 0 0 0 0];
internalField uniform (0 0 0);
boundaryField
{
    interface
    {
        type calculated;
        value uniform (0 0 0);
    }
    base
    {
        type fixedValue;
        value uniform (0 0 0);
    }
    outer
    {
        type calculated;
        value uniform (0 0 0);
    }
    ends
    {
        type calculated;
        value uniform (0 0 0);
    }
}
