cases/pdmsMicrochannelFSI/stabilityStudy/semiImplicitBetaIQNILS/constant/fluid/dynamicMeshDict
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object dynamicMeshDict;
}

dynamicFvMesh dynamicMotionSolverFvMesh;
"solver|motionSolver" velocityLaplacian;
diffusivity quadratic inverseDistance (interface);
