cases/pdmsMicrochannelFSI/stabilityStudy/semiImplicitBetaIQNILS/constant/fluid/fluidProperties
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object fluidProperties;
}

fluidModel pimpleFluid;
pimpleFluidCoeffs {}
