cases/pdmsMicrochannelFSI/stabilityStudy/semiImplicitBetaIQNILS/constant/fsiProperties
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object fsiProperties;
}

fluidSolidInterface robinRobin;

robinRobinCoeffs
{
 couplingScheme semiImplicitBeta;
 semiImplicitBeta 1;
 solidPatch interface;
 fluidPatch interface;

 // IQN-ILS accelerates the displacement fixed point; deal.II receives pure
 // Neumann traction because both configured impedances are zero.
 relaxationFactor 0.25;
 accelerationMethod iqnils;
 relaxationFactorMin 0.01;
 relaxationFactorMax 0.5;
 iqnMaxModes 12;
 // Cross-time reuse failed its contraction gate; keep filtered IQN local to
 // each time step while the physical interface-mass gate is evaluated.
 iqnReuseAcrossTimeSteps no;
 iqnModeFilterTolerance 1e-8;
 // Trust region: the compliant Robin interface is traction-sensitive, so an
 // IQN extrapolation may move at most one quarter of the current mismatch.
 iqnMaxCorrectionFactor 0.25;
 robinDataRelaxationFactor 1;
 predictSolid no;

 // External FEM participant. accepted-state remains fixed throughout the
 // outer loop; trial-state is promoted only after every convergence gate.
 useDealII yes;
 dealIIImpedance 0;
 dealIIInput "dealiiSolid/robin-in.csv";
 dealIIQueryInput "dealiiSolid/robin-query.csv";
 dealIIOutput "dealiiSolid/robin-out.csv";
 dealIICommand "$DEALII_PDMS_SOLID_BIN dealiiSolid/solid.prm";
 dealIIAcceptCommand "cp dealiiSolid/trial-state.bin dealiiSolid/accepted-state.bin";

 // All physical gates must pass in addition to the geometric FSI residual.
 robinVelocityTolerance 1e-4;
 robinForceTolerance 1e-4;
 robinPowerTolerance 1e-3;
 // Fixed characteristic scales avoid an ill-conditioned relative residual
 // as the compliant wall starts essentially from rest at 1 % flow.
 robinVelocityScale 3.0303030303e-3;
 robinTractionScale 100;

 interfaceDeformationLimit 0;
 interpolatorUpdateFrequency 0;
 outerCorrTolerance 1e-4;
 nOuterCorr 100;
 coupled yes;
 couplingStartTime -1;
 writeResidualsToFile yes;
}
