cases/pdmsMicrochannelFSI/stabilityStudy/semiImplicitBetaIQNILS/constant/physicsProperties
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object physicsProperties;
}

type fluidSolidInteraction;
