cases/pdmsMicrochannelFSI/stabilityStudy/semiImplicitBetaIQNILS/constant/solid/dynamicMeshDict
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object dynamicMeshDict;
}

dynamicFvMesh staticFvMesh;
