cases/pdmsMicrochannelFSI/stabilityStudy/semiImplicitBetaIQNILS/constant/solid/mechanicalProperties
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object mechanicalProperties;
}

planeStress no;
mechanical
(
 PDMS
 {
  type neoHookeanElastic;
  rho rho [1 -3 0 0 0 0 0] 970.0;
  mu mu [1 -1 -2 0 0 0 0] 778200.0;
  K K [1 -1 -2 0 0 0 0] 3631600.0;
 }
);
