cases/pdmsMicrochannelFSI/stabilityStudy/semiImplicitBetaIQNILS/system/fluid/blockMeshDict
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object blockMeshDict;
}

scale 1;
vertices
(
    (0 0 0)
    (0.00492 0 0)
    (0.00492 0.000492 0)
    (0 0.000492 0)
    (0 0 3.3e-05)
    (0.00492 0 3.3e-05)
    (0.00492 0.000492 3.3e-05)
    (0 0.000492 3.3e-05)
);
blocks ( hex (0 1 2 3 4 5 6 7) (80 24 10) simpleGrading (1 1 1) );
edges ();
boundary
(
 inlet { type patch; faces ((0 3 7 4)); }
 outlet { type patch; faces ((1 5 6 2)); }
 glass { type wall; faces ((0 1 2 3)); }
 interface { type wall; faces ((0 4 5 1) (3 2 6 7) (4 7 6 5)); }
);
mergePatchPairs ();
