cases/pdmsMicrochannelFSI/stabilityStudy/semiImplicitBetaIQNILS/system/solid/blockMeshDict
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object blockMeshDict;
}

scale 1;
vertices
(
    (0 -0.0005 0)
    (0 -0.0005 3.3e-05)
    (0 -0.0005 0.000533)
    (0 0 0)
    (0 0 3.3e-05)
    (0 0 0.000533)
    (0 0.000492 0)
    (0 0.000492 3.3e-05)
    (0 0.000492 0.000533)
    (0 0.000992 0)
    (0 0.000992 3.3e-05)
    (0 0.000992 0.000533)
    (0.00492 -0.0005 0)
    (0.00492 -0.0005 3.3e-05)
    (0.00492 -0.0005 0.000533)
    (0.00492 0 0)
    (0.00492 0 3.3e-05)
    (0.00492 0 0.000533)
    (0.00492 0.000492 0)
    (0.00492 0.000492 3.3e-05)
    (0.00492 0.000492 0.000533)
    (0.00492 0.000992 0)
    (0.00492 0.000992 3.3e-05)
    (0.00492 0.000992 0.000533)
);
blocks
(
    hex (0 12 15 3 1 13 16 4) (80 6 10) simpleGrading (1 1 1)
hex (1 13 16 4 2 14 17 5) (80 6 6) simpleGrading (1 1 1)
hex (4 16 19 7 5 17 20 8) (80 12 6) simpleGrading (1 1 1)
hex (6 18 21 9 7 19 22 10) (80 6 10) simpleGrading (1 1 1)
hex (7 19 22 10 8 20 23 11) (80 6 6) simpleGrading (1 1 1)
);
edges ();
boundary
(
 interface { type patch; faces ((3 15 16 4) (6 7 19 18) (4 7 19 16)); }
 base { type wall; faces ((0 12 15 3) (6 18 21 9)); }
 outer { type patch; faces ((0 1 13 12) (1 2 14 13) (9 21 22 10) (10 22 23 11) (2 5 17 14) (5 8 20 17) (8 11 23 20)); }
 ends { type patch; faces ((0 1 4 3) (1 2 5 4) (4 5 8 7) (6 7 10 9) (7 8 11 10) (12 13 16 15) (13 14 17 16) (16 17 20 19) (18 19 22 21) (19 20 23 22)); }
);
mergePatchPairs ();
